SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jcta_template/example/EWARM/hc32f460jcta.svd
                <register>
                    <name>CH0CTL</name>
                    <description>desc CH0CTL</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>SINC</name>
                            <description>desc SINC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DINC</name>
                            <description>desc DINC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRPTEN</name>
                            <description>desc SRPTEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTEN</name>
                            <description>desc DRPTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSEQEN</name>
                            <description>desc SNSEQEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSEQEN</name>
                            <description>desc DNSEQEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIZE</name>
                            <description>desc HSIZE</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPEN</name>
                            <description>desc LLPEN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPRUN</name>
                            <description>desc LLPRUN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSAR0</name>
                    <description>desc MONSAR0</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDAR0</name>
                    <description>desc MONDAR0</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDTCTL0</name>
                    <description>desc MONDTCTL0</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONRPT0</name>
                    <description>desc MONRPT0</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSNSEQCTL0</name>
                    <description>desc MONSNSEQCTL0</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONDNSEQCTL0</name>
                    <description>desc MONDNSEQCTL0</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SAR1</name>
                    <description>desc SAR1</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DAR1</name>
                    <description>desc DAR1</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTCTL1</name>
                    <description>desc DTCTL1</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RPT1</name>
                    <description>desc RPT1</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RPTB1</name>
                    <description>desc RPTB1</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPTB</name>
                            <description>desc SRPTB</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTB</name>
                            <description>desc DRPTB</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNSEQCTL1</name>
                    <description>desc SNSEQCTL1</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNSEQCTLB1</name>
                    <description>desc SNSEQCTLB1</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SNSDIST</name>
                            <description>desc SNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNTB</name>
                            <description>desc SNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DNSEQCTL1</name>
                    <description>desc DNSEQCTL1</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DNSEQCTLB1</name>
                    <description>desc DNSEQCTLB1</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DNSDIST</name>
                            <description>desc DNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSCNTB</name>
                            <description>desc DNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LLP1</name>
                    <description>desc LLP1</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFC</resetMask>
                    <fields>
                        <field>
                            <name>LLP</name>
                            <description>desc LLP</description>
                            <msb>31</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CTL</name>
                    <description>desc CH1CTL</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>SINC</name>
                            <description>desc SINC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DINC</name>
                            <description>desc DINC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRPTEN</name>
                            <description>desc SRPTEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTEN</name>
                            <description>desc DRPTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSEQEN</name>
                            <description>desc SNSEQEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSEQEN</name>
                            <description>desc DNSEQEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIZE</name>
                            <description>desc HSIZE</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPEN</name>
                            <description>desc LLPEN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPRUN</name>
                            <description>desc LLPRUN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSAR1</name>
                    <description>desc MONSAR1</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDAR1</name>
                    <description>desc MONDAR1</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDTCTL1</name>
                    <description>desc MONDTCTL1</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
